<?php
/*
 *    ____                        _
 *   |  _ \  ___  ___ _ __   ___ | |_ ___
 *   | | | |/ _ \/ __| '_ \ / _ \| __/ _ \
 *   | |_| |  __/\__ \ |_) | (_) | ||  __/
 *   |____/ \___||___/ .__/ \___/ \__\___|
 *                   |_|
 * 系统相关配置，可使用 c($key) 或者 \Utils::config($key) 获取值
 * @author      He110 (i@he110.info)
 */

return [
    // 是否开启错误捕获
    'error_catch' => true,
    // // 错误捕获相关配置
    // 'error'       => [
    //     // 错误捕获函数所在的类，如果是默认留空或者填 this
    //     'class'     => 'this',
    //     // 异常处理方法名
    //     'exception' => '',
    //     // 错误处理方法名
    //     'error'     => '',
    //     // 停止响应方法名
    //     'shutdown'  => '',
    // ],
    // 是否开启 debug 模式
    'debug'       => true,
    'sys_info'    => 'Despote 3.0',
];
